// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "檔案同步";

// Text of "ok" button, used in various dialogs.
"OK" = "好";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "取消";

// Text of "Next" button, used in various dialogs
"NEXT" = "下一個";

// Text of "Done" button, used in various dialogs
"DONE" = "完成";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "繼續";


// ------------------------
// Exception (error) window

"DESTINATION:" = "目標：";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "修改日期：";		// Modified label - prefixes the displayed mod date
"NAME:"        = "名稱：";			// Name label - prefixes the name of the file
"SIZE:"        = "大小：";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "在這部電腦上";	// For iDisk
".MAC"          = "在“%@”";				// For iDisk
"LOCAL_MHD"     = "在這部電腦上";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "位於網路上";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "顯示於 Finder";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "iDisk 錯誤";
"MHD ERROR TITLE"   = "個人專屬同步錯誤";
"FS ERROR TITLE"    = "檔案同步錯誤";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "錯誤碼為 %d。";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "iDisk 錯誤 %d∕%d";
"MHD ERROR COUNT%"   = "個人專屬同步錯誤 %d∕%d";
"FS ERROR COUNT%"    = "檔案同步錯誤 %d∕%d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "刪除檔案“%@”時發生問題。";
"ERROR SYNCING%"       = "同步檔案“%@”時發生問題。";
"ERROR MOVING%"        = "移動檔案“%@”時發生問題。";
"ERROR ACCESSING%"     = "同步檔案“%@”時發生問題。";
"DIR:ERROR DELETING%"  = "刪除檔案夾“%@”時發生問題。";
"DIR:ERROR SYNCING%"   = "同步檔案夾“%@”時發生問題。";
"DIR:ERROR MOVING%"    = "搬移檔案夾“%@”時發生問題。";
"DIR:ERROR ACCESSING%" = "同步檔案夾“%@”時發生問題。";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "您的 iDisk 空間將滿。iDisk 上沒有足夠的可用空間來同步此項目。";
"MHD DSKFULERR"        = "您的個人專屬目錄將滿。沒有足夠的可用空間來同步此項目。";
"FS DSKFULERR"         = "您的磁碟空間將滿。沒有足夠的可用空間來同步此項目。";
"IDISK DSKFULERR HELP" = "您 iDisk 上有些項目在“垃圾桶”裡。要釋出更多可用空間，請清空“垃圾桶”。";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "您沒有刪除此檔案的權限。";
"AFPACCESSDENIED SYNC"       = "您沒有同步此檔案的權限。";
"DIR:AFPACCESSDENIED DELETE" = "您沒有刪除此檔案夾的權限。";
"DIR:AFPACCESSDENIED SYNC"   = "您沒有同步此檔案夾的權限。";
"AFPACCESSDENIED HELP"       = "您可以在 Finder 的“簡介”面板裡檢查您的權限。";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "此檔案的名稱，與您 iDisk 上其他項目的名稱相同，只有某些字母的大小寫不同。";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "此檔案的名稱，與您個人專屬目錄上其他項目的名稱相同，只有某些字母的大小寫不同。";
"FS KSFFILENAMEDIFFERSBYCASE"        = "此檔案的名稱，與您磁碟上其他項目的名稱相同，只有某些字母的大小寫不同。";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "此檔案夾的名稱，與您 iDisk 上其他項目的名稱相同，只有某些字母的大小寫不同。";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "此檔案夾的名稱，與您個人專屬目錄上的其他項目的名稱相同，只有某些字母的大小寫不同。";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "此檔案夾的名稱，與您磁碟上其他項目的名稱相同，只有某些字母的大小寫不同。";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "您應該更改此項目名稱，以便與其他檔案使用不同的名稱。例如，在名稱中加入數字。";

// fBsyErr
"FSBSYERR"      = "檔案正在使用中。";
"FSBSYERR HELP" = "某個應用程式可能已經打開檔案。請嘗試關閉檔案或者結束應用程式。";

// fLckdErr
"FLCKDERR"      = "檔案已鎖定。";
"DIR:FLCKDERR"  = "檔案夾已鎖定";
"FLCKDERR HELP" = "您可以使用 Finder 的“簡介”面板來解鎖項目。";

"File Not Found"      = "沒有找到檔案。";
"HELP:File Not Found" = "同步時檔案可能已被移動。請再嘗試同步一次。";

"File Name Too Long"      = "檔案或檔案夾名稱太長。";
"HELP:File Name Too Long" = "請為此項目重新命名以使用較短的名稱。";

"I/O Error"      = "讀取或寫入檔案時發生錯誤。";
"HELP:I/O Error" = "請稍後再試。";

"Destination does not support symlinks"      = "目標不支援符號連結。";
"HELP:Destination does not support symlinks" = "請嘗試先壓縮檔案或檔案夾。";

"Object deleted"      = "項目在進行同步前已被刪除。";
//"HELP:Object deleted" = "";

"Object created"      = "這個項目在進行同步前已有項目新增於同一位置。";
//"HELP:Object created" = "";

"Object modified"     = "這個需要更新的項目在進行同步前已由其他應用程式修改。";
//"HELP:Object modified" = "";

"Network error"       = "發生網路錯誤。";
"HELP:Network error"  = "請檢查您的網路連線，或稍後再試一次。";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "發生問題。";					// [rdar://5231555]
"HELP:Unknown error"       = "請稍後再試。";
"HELP-IDISK:Unknown error" = "請稍後再試。";
"HELP-PHD:Unknown error"   = "請稍後再試。若問題依然存在，請聯絡您的網路管理者。";

"IDISK ALMOST FULL"     = "您的 iDisk 空間將滿。";
"ALMOST FULL TRASH MSG" = "您 iDisk 上有些檔案在“垃圾桶”裡。要釋出更多可用空間，請清空“垃圾桶”。\n\n您可以在“系統偏好設定”的“%@”面板上增加 iDisk 的大小。";
"ALMOST FULL .MAC MSG"  = "您可以在“系統偏好設定”的“%@”面板上增加 iDisk 的大小。";

"REVERIFICATION"      = "之前進行的 %@ 次同步中，每一次都有檔案產生變動。";
"REVERIFICATION HELP" = "某個應用程式可能正在週期性地修改檔案。請嘗試關閉檔案或結束應用程式。";

"TOO_MANY_EAS"      = "目標不支援此項目裡所包含的部分資料。";
"TOO_MANY_EAS HELP" = "請嘗試先壓縮檔案或檔案夾。";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "只有當您的 iDisk 已連線時，才可以使用“%@”檔案夾。";
"OFFLINE FOLDER MSG" = "您必須將電腦連接到 Internet 才能連接此檔案夾。";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu byte";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 個衝突";
"%CONFLICTS" = "%d 個衝突";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "已在兩個位置修改“%@”。";			// Name of conflicting item.
"%WHERE"                   = "位置：%@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d∕%d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-root-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "檔案";
"FOLDER"                   = "檔案夾";
"PACKAGE"                  = "套件";
"SYMLINK"                  = "symlink";
"IDISK_LOCAL_TITLE"        = "這部電腦";
"IDISK_POPUP_LOCAL_TITLE"  = "將檔案保留在這部電腦";
"IDISK_POPUP_REMOTE_TITLE" = "將檔案保留在“%@”";
"MHD_LOCAL_TITLE"          = "在這部電腦上";
"MHD_REMOTE_TITLE"         = "位於網路上";
"MHD_POPUP_LOCAL_TITLE"    = "將檔案保留在這部電腦";
"MHD_POPUP_REMOTE_TITLE"   = "將檔案保留在網路";
"1_IDISK_CONFLICT"         = "發生一個 iDisk 同步衝突。";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "發生 %d 個 iDisk 同步衝突。";			// Plural for iDisk
"1_MHD_CONFLICT"           = "發生一個個人專屬同步衝突。";				// Singular for MHD
"%_MHD_CONFLICTS"          = "發生 %d 個個人專屬同步衝突。";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "使用“%@”上的檔案來解決所有衝突";
"IDISK_RESOLVE_LOCAL"      = "使用這部電腦上的檔案來解決所有衝突";
"IDISK_RESOLVE_BOTH"       = "保留所有檔案以解決所有衝突";
"IDISK_RESOLVE_LASTMOD"    = "藉由將檔案保持在最新修改日期的版本來解決所有衝突。";
"IDISK_RESOLVE_EXCLUDE"    = "未來進行同步時排除這些檔案以解決所有衝突。";
"IDISK_RESOLVE_NONE"       = "忽略所有衝突。";
"MHD_RESOLVE_REMOTE"       = "使用此網路上的檔案來解決所有衝突";
"MHD_RESOLVE_LOCAL"        = "使用這部電腦上的檔案來解決所有衝突";
"MHD_RESOLVE_BOTH"         = "保留所有檔案以解決所有衝突";
"MHD_RESOLVE_LASTMOD"      = "藉由將檔案保持在最新修改日期的版本來解決所有衝突。";
"MHD_RESOLVE_EXCLUDE"      = "未來進行同步時排除這些檔案以解決所有衝突。";
"MHD_RESOLVE_NONE"         = "忽略所有衝突。";
"MHD_CONFLICT_TITLE"       = "同步衝突";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "無法解決所有衝突";
"NOT_ALL_RESOLVED_MSG"   = "無法解決某些衝突，因為它們的修改日期太過相近。請手動解決這些衝突，或使用不同的選項。";

"There are no file syncing errors or conflicts." = "沒有檔案同步錯誤或衝突。";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "您的 iDisk 未完成同步。請稍候再試一次。";
"GLOBAL-HELP-IDISK:Timeout" = "如果您同步 iDisk 時仍然出現問題，原因可能是網路連線有問題。請嘗試結束其他使用 Internet 網路的應用程式，然後再試一次。";

"GLOBAL-IDISK:NetworkError"      = "您的 iDisk 未完成同步。";
"GLOBAL-HELP-IDISK:NetworkError" = "請檢查您的網路連線，或稍後再試一次。";

"GLOBAL-IDISK:RemoteBusy"      = "您的 iDisk 未完成同步。";
"GLOBAL-HELP-IDISK:RemoteBusy" = "請稍後再試。";

"GLOBAL-IDISK:UNKNOWN"      = "因為發生問題，所以您的 iDisk 未完成同步。";
"GLOBAL-HELP-IDISK:UNKNOWN" = "請稍後再試。";

// PHD
"GLOBAL-PHD:Timeout"      = "您的個人專屬目錄未完成同步。請稍候再試一次。";
"GLOBAL-HELP-PHD:Timeout" = "如果您同步個人專屬目錄時仍然出現問題，原因可能是網路連線有問題。請嘗試結束其他使用網路的應用程式，然後再試一次。";

"GLOBAL-PHD:NetworkError"      = "您的個人專屬目錄未完成同步。";
"GLOBAL-HELP-PHD:NetworkError" = "請檢查您的網路連線，或稍後再試一次。";

"GLOBAL-PHD:RemoteBusy"      = "您的個人專屬目錄未完成同步。";
"GLOBAL-HELP-PHD:RemoteBusy" = "請稍後再試。";

"GLOBAL-PHD:UNKNOWN"      = "因為發生問題，所以您的個人專屬目錄未完成同步。";
"GLOBAL-HELP-PHD:UNKNOWN" = "請稍後再試。";

// Other
"GLOBAL-FS:Timeout"      = "您的檔案未完成同步。請稍後再試一次。";
"GLOBAL-HELP-FS:Timeout" = "如果您同步檔案時仍然出現問題，原因可能是網路連線有問題。請嘗試結束其他使用網路的應用程式，然後再試一次。";

"GLOBAL-FS:NetworkError"      = "您的檔案未完成同步。";
"GLOBAL-HELP-FS:NetworkError" = "請檢查您的網路連線，或稍後再試一次。";

"GLOBAL-FS:RemoteBusy"      = "您的檔案未完成同步。";
"GLOBAL-HELP-FS:RemoteBusy" = "請稍後再試。";

"GLOBAL-FS:UNKNOWN"      = "因為發生問題，所以您的檔案未完成同步。";
"GLOBAL-HELP-FS:UNKNOWN" = "請稍後再試。";
